mesh_indep/peh_base_case_m1_2D/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.006866;

boundaryField
{

	"(inlet|outlet)"
    {
        type            cyclic;
    }
	"(front|back)"
	{
		type empty;
	}
    "(top|hills)"
    {
        type            epsilonWallFunction;
        value           $internalField;
    }


}


// ************************************************************************* //
